Tekla Open API Reference for Tekla Structures 2025
Events Class
 The Events class allows the user to register event listeners for model events.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 Tekla.Structures.Model.Events
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Events : MarshalByRefObject,
	IEvents, IDisposable
<SerializableAttribute>
Public NotInheritable Class Events
	Inherits MarshalByRefObject
	Implements IEvents, IDisposable
The Events type exposes the following members.
Constructors
Name | Description
Events
 Creates an empty events instance.
Top
Methods
Name | Description
Dispose
 Disposes the instance.
InitializeLifetimeService
 Initializes the lifetime service.
 (Overrides MarshalByRefObject.InitializeLifetimeService().)
OnInterrupted
 Called when uesr interrupts.
OnModelSaveInfo
 Called when model is saved.
OnUndoClicked
 Called when user clicks undo.
Register
 Registers the instance to listen to the specified events. More event delegates should not be added without calling UnRegister first.
UnRegister
 Unregisters the instance from listening to events.
Top
Events
Name | Description
AnnotationSelectionChange
 The SelectionChange event is raised when the user changes the current selection of an annotation inside Tekla Structures.
ClashCheckDone
 The ClashCheckDone event is raised just after clash check is completed.
ClashDetected
 The ClashDetected event is raised just after the detection of each clash. The clash information is saved before the event is triggered.
ClipPlaneChanged
 Occurs when user deletes a clip plane.
CommandStatusChange
 The CommandStatusChange event is raised when a command is started/ended.
HiddenObjectsChanged
 Occurs when user hides an object or view is redrawn
Interrupted
 Occurs when user interrupts.
ModelChanged |  Obsolete.
 The ModelChanged event is raised just after some changes have been made to the model.
Note, this event is however not triggered when UNDO or REDO are performed.
ModelLoad
 The ModelLoad event is raised just after a model has been loaded.
ModelLoadInfo
 The ModelLoadInfo event is raised just after a model has been loaded with the model load information as a string parameter.
ModelObjectChanged
 The ModelObjectChanged event is raised just after some changes have been made to the model objects.
Note, this event is triggered when UNDO or REDO are performed!!
ModelObjectNumbered
 The ModelObjectNumbered event is raised when model object is numbered.
ModelSave
 The ModelSave event is raised just after a model has been saved.
ModelSaveAs
 The ModelSaveAs event is raised just after a model has been saved using save as.
ModelSaveInfo
 The ModelSave event is raised just after a model has been saved with the model save information as a string parameter.
ModelUnloading
 The ModelUnloading event is raised just before the model is unloaded.
ModelUnloadingSync
 The ModelUnloadingSync event is raised synchronously on the main thread just before the model is unloaded.
 Use this event only when core resources need be cleaned up before the model unloading proceeds. All UI-only related resource cleanup should be done in the async ModelUnloading event.
OnModelUnloadingSync(String, Object[])
Numbering
 The Numbering event is raised just after a model has been numbered.
ProjectInfoChanged
 The ProjectInfoChanged event is raised just after some changes have been made to the project info.
Note, this event is however not triggered when UNDO or REDO are performed.
SelectionChange
 The SelectionChange event is raised when the user changes the current selection inside Tekla Structures.
TeklaStructuresExit
 The TeklaStructuresExit event is raised just before Tekla Structures exits. After this event has been called the user will no longer be able to perform any calls to Tekla Structures.
TemporaryStatesChanged
 Occurs when temporary states are changed.
UndoClicked
 Occurs when user clicks undo.
ViewCameraChanged
 Occurs when view camera is changed.
ViewClosed
 Occurs when view is closed.
Top
Remarks
 Asynchronous event handling
Registered event handlers are called asynchronously so that many handlers may be running simultaneously. Event handlers are not guaranteed to be run in the same thread where they were registered. The asynchronous nature of the events requires the use of synchronization constructs on objects and data structures that are not defined to be thread safe.
Microsoft's documentation about the lock statement: http://msdn.microsoft.com/en-us/library/c5kehkcz.aspx
Microsoft's documentation about delegates: http://msdn.microsoft.com/en-us/library/900fyy8e.aspx
Microsoft's documentation about managed threading: http://msdn.microsoft.com/en-us/library/1c9txz50.aspx
Examples
 The following example shows how to make sure that only one selection event handler is running at a time.
 using Tekla.Structures.Model;
 public class Example
 {
     private Tekla.Structures.Model.Events _events = new Tekla.Structures.Model.Events();
     private object _selectionEventHandlerLock = new object();
     private object _changedObjectHandlerLock = new object();
     public void RegisterEventHandler()
     {
         _events.SelectionChange += Events_SelectionChangeEvent;
         _events.ModelObjectChanged += Events_ModelObjectChangedEvent;
         _events.Register();
     }
     public void UnRegisterEventHandler()
     {
         _events.UnRegister();
     }
     void Events_SelectionChangeEvent()
     {
         /* Make sure that the inner code block is running synchronously */
         lock(_selectionEventHandlerLock)
         {
             System.Console.WriteLine("Selection changed event received.");
         }
     }
     void Events_ModelObjectChangedEvent(List<ChangeData> changes)
     {
         /* Make sure that the inner code block is running synchronously */
         lock (_changedObjectHandlerLock)
         {
             foreach(ChangeData data in changes)
                 System.Console.WriteLine("Changed event received " + ":" + data.Object.ToString() + ":" + " Type" + ":" + data.Type.ToString() + " guid: " + data.Object.Identifier.GUID.ToString());
             System.Console.WriteLine("Changed event received for " + changes.Count.ToString() + " objects");
         }
     }
}
See Also
Reference
Tekla.Structures.Model Namespace